Repository: OSGeo-jp/OSGeoLive-doc-omegat
Catalog: tm/overview--mapnik_overview.tmx
Source language: en
Languages: ja

source: Cartographic rendering engine
ja: 地図製作用レンダリングエンジン

source: Mapnik is a toolkit for rendering beautiful maps, with clean, soft feature edges provided by quality anti-aliasing graphics, intelligent label placement, and scalable, SVG symbolisation. Most famously, mapnik is used to render the OpenStreetMap main map layers.
ja: Mapnik は美しい地図を描画するツールキットで、高品質なアンチエイリアス処理によるクリーンでソフトなフィーチャの描画、インテリジェントなラベル配置、SVG によるスケーリング可能なシンボル描画が可能です。Open Street Map のメイン地図レイヤ描画エンジンとして、よく知られています。

source: Mapnik has typically been embedded in Python applications which deliver their maps over the internet although scaling improvements have meant that Mapnik has recently been getting used to create high resolution paper maps too.
ja: Mapnikは通常、インターネット経由でマップを配信するPythonアプリケーションに組み込まれていますが、スケーリングの改善により、最近では高解像度の紙のマップの作成にも使われるようになりました。

source: Core Features
ja: 主要機能

source: Essentially a collection of geographic objects (map, layer, datasource, feature, geometry), the library doesn't rely on "windowing systems" and can be deployed in any server environment. It is intended to play fair in a multi-threaded environment and is aimed primarily, but not exclusively, at web-based development.
ja: Mapnik はどのようなウィンドウシステムにも依存することなく、ジオグラフィックオブジェクト（マップ、レイヤ、データソース、フィーチャ、ジオメトリ）のコレクションをサーバー環境に展開することができます。また、マルチスレッド Web アプリケーション開発のためにスレッドセーフで動作することを目的としています。

source: High-level Python bindings (boost.python) facilitate rapid application development, targeting zope3, django etc.
ja: 高レベルのPythonバインディング(boost.python)は、zope3やdjangoなどをターゲットにして、迅速なアプリケーション開発を促進します。

source: Mapnik is cross platform. Packages are available for most linux distributions and installers are commonly used on Mac OS X and windows.
ja: Mapnikはクロスプラットフォームです。パッケージはほとんどのLinuxディストリビューションで使用でき、インストーラは一般にMac OS XとWindowsで使用されます。

source: Details
ja: 詳細

source: **Website:** https://mapnik.org/
ja: *Webサイト:** https://mapnik.org/

source: **Licence:** LGPL (GNU Lesser General Public Licence)
ja: **ライセンス:** LGPL (GNU Lesser General Public Licence)

source: **Software Version:** |version-mapnik|
ja: **ソフトウェアバージョン:** |version-mapnik|

source: **Supported Platforms:** Windows, Linux, Mac
ja: **対応プラットフォーム:** Windows, Linux, Mac

source: **API Interfaces:** C++, Python
ja: **API インターフェイス:** C++, Python

source: Quickstart
ja: クイックスタート

source: :doc:`Quickstart documentation <../quickstart/mapnik_quickstart>`
ja: :doc:`クイックスタート文書 <../quickstart/mapnik_quickstart>`
